<a href="https://colab.research.google.com/github/ErrorNginx/My-project-google-colab/blob/main/data%20cleansing%20titanik%203%20/%20data_cleansing_titanik_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Manipulation With Python

Hi Saya agus.. Disini saya akan coba sedikit sharing2 tentang Data Manipulation With Python..

Data Manipulasi disini bukan bermakna merekayasa data, bukan membuat data menjadi tidak sesuai dengan nilai aslinya.. Tetapi Data Manipulasi disini untuk mempermudah data ketika di analisis oleh mesin..

import library-library yang akan diperlukan

In [ ]:
import pandas as pd
import numpy as np

Pandas mempunyai dua object yaitu series dan data frame

# Object Series

Object Series mempunyai satu dimensi data.. Tidak mempunyai nama column karna hanya memiliki satu column saja.. Dan mempunyai indeks..

In [ ]:
data = [0.25, 0.50, 0.75, 1]

merubah data ke dalam bentuk series

In [ ]:
data = pd.Series(data)

In [ ]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

convert dari series menjadi array

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

menampikan indeks..

indeks berupa range, dimana titik start nya itu inklusif dalam renge dan titik stop nya itu eksklusif dari range..

In [ ]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
list(range(1,10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

cara memanggil data

In [ ]:
data[2]

0.75

indeks implisit adalah indeks default nya.. 

kita bisa mendefinisikan indeks nya, ini disebut indeks eksplisit yaitu indeks yg di defined.. 

ketika mendefinisikan indeks, jumlah indeks harus sama dengan jumlah data nya..

In [ ]:
data = pd.Series([0.25, 0.50, 0.75, 1], index=['a','b','c','d'])

In [ ]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [ ]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

panggil data nya

In [ ]:
#indeks eksplisit

data['a']

0.25

ini adalah data selection

walaupun kita sudah membuat indeks eksplisit, kita masih bisa memanggil indeks implisit nya..

In [ ]:
#indeks implisit

data[3]

1.0

ketika indeks implisit dan indeks eksplisit nya ada yg sama.. ketika kita memanggil data nya, maka dia hanya akan mengandalkan indeks eksplisit nya..

In [ ]:
data_2 = pd.Series([0.25, 0.50, 0.75, 1], index=[2,5,3,7])

In [ ]:
data_2[2]

0.25

In [ ]:
data_2[0]

KeyError: 0

kita akan coba melakukan data slicing

In [ ]:
data = pd.Series([0.25, 0.50, 0.75, 1], index=['a','b','c','d'])

In [ ]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

misalnya kita akan memanggil dari data b sampai data c

In [ ]:
data['b':'c'] #indeks eksplisit

b    0.50
c    0.75
dtype: float64

tapi bila kita slicing indeks implisit nya, maka hanya akan muncul titik start nya.. karna indeks implisit berupa range..

In [ ]:
data[1:2] #indeks implisit

b    0.5
dtype: float64

# loc dan iloc

contoh data yang indeks implisit dan indeks eksplisit nya ada yg sama

In [ ]:
data_2 = pd.Series([0.25, 0.50, 0.75, 1], index=[2,5,3,7])

In [ ]:
data_2

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

ketika kita akses satu indeks maka yg muncul adalah indeks eksplisit nya..

In [ ]:
data_2[2] #indeks eksplisit : selecting

0.25

ketika kita panggil indeks eksplisit dari indeks 2 sampai indeks 3.. nilai yg muncul justru dari indeks impplisit nya..

In [ ]:
data_2[2:3] #indeks implisit : slicing

3    0.75
dtype: float64

ketika indeks eksplisit dan indeks implisit ada yg sama maka akan terjadi inkonsistensi seperti case di atas..

untuk mengatasi keadaan inkonsistensi tersebut maka kita akan gunakan kaidah loc dan iloc..

loc adalah untuk memanggil indeks eksplisit nya..

iloc adalah untuk memanggil indeks implisit nya..

In [ ]:
#loc

data_2.loc[3] #selecting indeks eksplisit

0.75

In [ ]:
data_2.loc[2:3] #slicing indeks eksplisit

2    0.25
5    0.50
3    0.75
dtype: float64

In [ ]:
#iloc

data_2.iloc[3] #selecting indeks implisit

1.0

In [ ]:
data_2.iloc[2:3] #slicing indeks implisit

3    0.75
dtype: float64

# Data Frame

Data Frame adalah kumpulan dari series, dengan minimal satu buah series..

In [ ]:
dict_populasi = {'Jakarta':750, 
                 'Bogor':490,
                 'Depok':350,
                 'Tanggerang':270,
                 'Bekasi':670}

#ini hanya permisalan, bukan angka populasi yg sesungguhnya

In [ ]:
dict_populasi

{'Jakarta': 750, 'Bogor': 490, 'Depok': 350, 'Tanggerang': 270, 'Bekasi': 670}

In [ ]:
#transformasi dictionary ke series

populasi = pd.Series(dict_populasi)

In [ ]:
populasi

Jakarta       750
Bogor         490
Depok         350
Tanggerang    270
Bekasi        670
dtype: int64

In [ ]:
populasi.loc['Depok']

350

In [ ]:
populasi.iloc[2]

350

In [ ]:
dict_luas = {'Jakarta':737, 
                 'Bogor':325,
                 'Depok':247,
                 'Tanggerang':302,
                 'Bekasi':355}

#ini hanya permisalan, bukan angka luas yg sesungguhnya

In [ ]:
luas = pd.Series(dict_luas)

In [ ]:
luas

Jakarta       737
Bogor         325
Depok         247
Tanggerang    302
Bekasi        355
dtype: int64

In [ ]:
daerah = pd.DataFrame({'pop':populasi, 'luas':luas})

In [ ]:
daerah

            pop  luas
Jakarta     750   737
Bogor       490   325
Depok       350   247
Tanggerang  270   302
Bekasi      670   355

In [ ]:
daerah['luas']['Jakarta']

737

ketika memanggil data dengan syntax daerah.pop akan muncul seperti di bawah ini

karena pop sama dengan nama fungsi yg ada di data frame

In [ ]:
daerah.pop

<bound method NDFrame.pop of             pop  luas
Jakarta     750   737
Bogor       490   325
Depok       350   247
Tanggerang  270   302
Bekasi      670   355>

maka lebih aman memanggil data dengan syntax daerah['populasi']

In [ ]:
daerah['pop']

Jakarta       750
Bogor         490
Depok         350
Tanggerang    270
Bekasi        670
Name: pop, dtype: int64

kita ganti nama column pop menjadi populasi

In [ ]:
daerah = pd.DataFrame({'populasi':populasi, 'luas':luas})

In [ ]:
daerah

            populasi  luas
Jakarta          750   737
Bogor            490   325
Depok            350   247
Tanggerang       270   302
Bekasi           670   355

In [ ]:
daerah['populasi']

Jakarta       750
Bogor         490
Depok         350
Tanggerang    270
Bekasi        670
Name: populasi, dtype: int64

In [ ]:
daerah['populasi']['Jakarta':'Depok'] #indeks eksplisit

Jakarta    750
Bogor      490
Depok      350
Name: populasi, dtype: int64

In [ ]:
daerah['populasi'].iloc[0:3] #indeks implisit

Jakarta    750
Bogor      490
Depok      350
Name: populasi, dtype: int64

In [ ]:
#menambahkan column baru

daerah['pop_per_area']=daerah['populasi']/daerah['luas']

In [ ]:
daerah

            populasi  luas  pop_per_area
Jakarta          750   737      1.017639
Bogor            490   325      1.507692
Depok            350   247      1.417004
Tanggerang       270   302      0.894040
Bekasi           670   355      1.887324

In [ ]:
#menambah baris baru

daerah_tambahan=pd.DataFrame({'Bandung':[151, 148,0.18]})

In [ ]:
daerah_tambahan

   Bandung
0   151.00
1   148.00
2     0.18

In [ ]:
daerah_tambahan=daerah_tambahan.T

In [ ]:
daerah_tambahan

             0      1     2
Bandung  151.0  148.0  0.18

In [ ]:
daerah_tambahan.columns=daerah.columns

In [ ]:
daerah_tambahan

         populasi   luas  pop_per_area
Bandung     151.0  148.0          0.18

In [ ]:
#menggabungkan data daerah dan data daerah_tambahan dengan concat

pd.concat([daerah, daerah_tambahan])

            populasi   luas  pop_per_area
Jakarta        750.0  737.0      1.017639
Bogor          490.0  325.0      1.507692
Depok          350.0  247.0      1.417004
Tanggerang     270.0  302.0      0.894040
Bekasi         670.0  355.0      1.887324
Bandung        151.0  148.0      0.180000

In [ ]:
#menghapus column tidak permanen, artinya masih tersimpan di data source nya

daerah.drop('pop_per_area', axis=1)

            populasi  luas
Jakarta          750   737
Bogor            490   325
Depok            350   247
Tanggerang       270   302
Bekasi           670   355

In [ ]:
daerah

            populasi  luas  pop_per_area
Jakarta          750   737      1.017639
Bogor            490   325      1.507692
Depok            350   247      1.417004
Tanggerang       270   302      0.894040
Bekasi           670   355      1.887324

In [ ]:
#menghapus baris tidak permanen, artinya masih tersimpan di data source nya

daerah.drop('Bekasi', axis=0)

            populasi  luas  pop_per_area
Jakarta          750   737      1.017639
Bogor            490   325      1.507692
Depok            350   247      1.417004
Tanggerang       270   302      0.894040

In [ ]:
daerah

            populasi  luas  pop_per_area
Jakarta          750   737      1.017639
Bogor            490   325      1.507692
Depok            350   247      1.417004
Tanggerang       270   302      0.894040
Bekasi           670   355      1.887324

In [ ]:
#rename column

In [ ]:
daerah.columns

Index(['populasi', 'luas', 'pop_per_area'], dtype='object')

In [ ]:
#cara 1 #permanen

daerah.columns = ['populasi', 'luas_m2', 'pop_per_area']

In [ ]:
daerah

            populasi  luas_m2  pop_per_area
Jakarta          750      737      1.017639
Bogor            490      325      1.507692
Depok            350      247      1.417004
Tanggerang       270      302      0.894040
Bekasi           670      355      1.887324

In [ ]:
#cara 2 #tidak permanen

daerah.rename(columns={'populasi':'populasi_daerah','luas_m2':'luas_daerah'})

            populasi_daerah  luas_daerah  pop_per_area
Jakarta                 750          737      1.017639
Bogor                   490          325      1.507692
Depok                   350          247      1.417004
Tanggerang              270          302      0.894040
Bekasi                  670          355      1.887324

In [ ]:
daerah

            populasi  luas_m2  pop_per_area
Jakarta          750      737      1.017639
Bogor            490      325      1.507692
Depok            350      247      1.417004
Tanggerang       270      302      0.894040
Bekasi           670      355      1.887324

In [ ]:
#cara 2 #permanen

daerah.rename(columns={'populasi':'populasi_daerah','luas_m2':'luas_daerah'}, inplace=True)

In [ ]:
daerah

            populasi_daerah  luas_daerah  pop_per_area
Jakarta                 750          737      1.017639
Bogor                   490          325      1.507692
Depok                   350          247      1.417004
Tanggerang              270          302      0.894040
Bekasi                  670          355      1.887324

In [ ]:
#rename column menjadi tulisan besar semua

daerah.rename(columns=str.upper)

            POPULASI_DAERAH  LUAS_DAERAH  POP_PER_AREA
Jakarta                 750          737      1.017639
Bogor                   490          325      1.507692
Depok                   350          247      1.417004
Tanggerang              270          302      0.894040
Bekasi                  670          355      1.887324

In [ ]:
daerah

            populasi_daerah  luas_daerah  pop_per_area
Jakarta                 750          737      1.017639
Bogor                   490          325      1.507692
Depok                   350          247      1.417004
Tanggerang              270          302      0.894040
Bekasi                  670          355      1.887324

# Sorting

In [ ]:
#misalnya kita akan sorting column populasi_daerah dari kecil ke besar

daerah.sort_values('populasi_daerah')

            populasi_daerah  luas_daerah  pop_per_area
Tanggerang              270          302      0.894040
Depok                   350          247      1.417004
Bogor                   490          325      1.507692
Bekasi                  670          355      1.887324
Jakarta                 750          737      1.017639

In [ ]:
#misalnya kita akan sorting column populasi_daerah dari besar ke kecil

daerah.sort_values('populasi_daerah', ascending=False)

            populasi_daerah  luas_daerah  pop_per_area
Jakarta                 750          737      1.017639
Bekasi                  670          355      1.887324
Bogor                   490          325      1.507692
Depok                   350          247      1.417004
Tanggerang              270          302      0.894040

In [ ]:
#melihat jumlah dari data

daerah.sum()

populasi_daerah    2530.000000
luas_daerah        1966.000000
pop_per_area          6.723699
dtype: float64

# Data Titanic

In [ ]:
#kita load data titanic

df = pd.read_csv('data/Titanic.csv')

In [ ]:
#melihat dari data teratas

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#melihat dari data terbawah

df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
#melihat jumlah baris dan jumlah column

df.shape

(891, 12)

In [ ]:
#melihat columns

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
#melihat index

df.index

RangeIndex(start=0, stop=891, step=1)

In [ ]:
#melihat info data

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 66.2+ KB

In [ ]:
#menampilkan informasi dari column-column yg berbentuk angka

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
#melihat jumlah non null dari data

df.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [ ]:
#melihat jumlah NaN dari data

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#melihat jumlah dari data

df.sum()

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                      21205.2
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                     28693.9
dtype: object

In [ ]:
#melihat mean dari data

df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [ ]:
#misalnya menampilkan rerata dari column Age

df['Age'].mean()

29.69911764705882

In [ ]:
#misalnya menampilkan median dari column Age

df['Age'].median()

28.0

In [ ]:
#misalnya menampilkan mode dari column Age

df['Age'].mode()[0]

24.0

In [ ]:
#misalnya menampilkan min dari column Age

df['Age'].min()

0.42

In [ ]:
#misalnya menampilkan max dari column Age

df['Age'].max()

80.0

In [ ]:
#misalnya melihat NaN dari ccolumn Age

df.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [ ]:
#kemudian kita masking

[df.Age.isnull()] #misalnya melihat NaN dari ccolumn Age

[0      False
 1      False
 2      False
 3      False
 4      False
        ...
 886    False
 887    False
 888     True
 889    False
 890    False
 Name: Age, Length: 891, dtype: bool]

In [ ]:
#kemudian ke bentuk data frame

df[df.Age.isnull()] #misalnya melihat NaN dari ccolumn Age

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [ ]:
#misalnya melihat data unique dari Column Sex

df.Sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
#misalnya melihat jumlah unique dari Column Sex

df.Sex.nunique()

2

In [ ]:
#melihat proporsi dari column Sex

df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
#cara memanggil column-culumn tertentu

df[['Survived','Name','Age']]

     Survived                                               Name   Age
0           0                            Braund, Mr. Owen Harris  22.0
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2           1                             Heikkinen, Miss. Laina  26.0
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4           0                           Allen, Mr. William Henry  35.0
..        ...                                                ...   ...
886         0                              Montvila, Rev. Juozas  27.0
887         1                       Graham, Miss. Margaret Edith  19.0
888         0           Johnston, Miss. Catherine Helen "Carrie"   NaN
889         1                              Behr, Mr. Karl Howell  26.0
890         0                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

In [ ]:
#bisa juga kita defined terlebih dahulu berbentuk list

sel_columns = ['Survived','Name','Age']
df[sel_columns]

     Survived                                               Name   Age
0           0                            Braund, Mr. Owen Harris  22.0
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2           1                             Heikkinen, Miss. Laina  26.0
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4           0                           Allen, Mr. William Henry  35.0
..        ...                                                ...   ...
886         0                              Montvila, Rev. Juozas  27.0
887         1                       Graham, Miss. Margaret Edith  19.0
888         0           Johnston, Miss. Catherine Helen "Carrie"   NaN
889         1                              Behr, Mr. Karl Howell  26.0
890         0                                Dooley, Mr. Patrick  32.0

[891 rows x 3 columns]

In [ ]:
#misalnya kita akan memanggil column Survived yang value nya 1

In [ ]:
df[df['Survived']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
#misalnya kita akan memanggil column Age yang value nya lebih dari 50 saja

df[df['Age']>50]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...,...,...,...
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [ ]:
#misalnya kita akan memanggil column Age yang value nya kurang dari sama dengan 50 

df[~(df['Age']>50)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
#misalnya kita akan memanggil column Age yang value nya lebih dari 50 dan column Sex yg male

df[(df['Age']>50) & (df['Sex']=='male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
124,125,0,1,"White, Mr. Percival Wayland",male,54.0,0,1,35281,77.2875,D26,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S
174,175,0,1,"Smith, Mr. James Clinch",male,56.0,0,0,17764,30.6958,A7,C
222,223,0,3,"Green, Mr. George Henry",male,51.0,0,0,21440,8.0500,NaN,S
232,233,0,2,"Sjostedt, Mr. Ernst Adolf",male,59.0,0,0,237442,13.5000,NaN,S
249,250,0,2,"Carter, Rev. Ernest Courtenay",male,54.0,1,0,244252,26.0000,NaN,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
262,263,0,1,"Taussig, Mr. Emil",male,52.0,1,1,110413,79.6500,E67,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
317,318,0,2,"Moraweck, Dr. Ernest",male,54.0,0,0,29011,14.0000,NaN,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
406,407,0,3,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.0,0,0,113786,30.5000,C104,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
467,468,0,1,"Smart, Mr. John Montgomery",male,56.0,0,0,113792,26.5500,NaN,S
487,488,0,1,"Kent, Mr. Edward Austin",male,58.0,0,0,11771,29.7000,B37,C
492,493,0,1,"Molson, Mr. Harry Markland",male,55.0,0,0,113787,30.5000,C30,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
582,583,0,2,"Downton, Mr. William James",male,54.0,0,0,28403,26.0000,NaN,S
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.2000,B41,C
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
626,627,0,2,"Kirkland, Rev. Charles Leonard",male,57.0,0,0,219533,12.3500,NaN,Q
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
631,632,0,3,"Lundahl, Mr. Johan Svensson",male,51.0,0,0,347743,7.0542,NaN,S
647,648,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.0,0,0,13213,35.5000,A26,C
659,660,0,1,"Newell, Mr. Arthur Webster",male,58.0,0,2,35273,113.2750,D48,C
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
684,685,0,2,"Brown, Mr. Thomas William Solomon",male,60.0,1,1,29750,39.0000,NaN,S
694,695,0,1,"Weir, Col. John",male,60.0,0,0,113800,26.5500,NaN,S
695,696,0,2,"Chapman, Mr. Charles Henry",male,52.0,0,0,248731,13.5000,NaN,S
714,715,0,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S

In [ ]:
#misalnya kita akan memanggil column Age yang value nya lebih dari 50 atau column Sex yg male

df[(df['Age']>50) | (df['Sex']=='male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
#misalnya kita akan memanggil column Age yang value nya antara 20 dan 40

df[((df['Age']>20) & (df['Age']<40))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
#misalnya kita akan memanggil column Survived dan Column Pclass dimana Age nya lebih dari 50 atau Sex nya yg male

df[['Survived','Pclass','Age','Sex']][(df['Age']>50) | (df['Sex']=='male')]

     Survived  Pclass   Age   Sex
0           0       3  22.0  male
4           0       3  35.0  male
5           0       3   NaN  male
6           0       1  54.0  male
7           0       3   2.0  male
..        ...     ...   ...   ...
883         0       2  28.0  male
884         0       3  25.0  male
886         0       2  27.0  male
889         1       1  26.0  male
890         0       3  32.0  male

[594 rows x 4 columns]

# Pivot

Pivot ini merangkum data agar lebih mudah dipahami

In [ ]:
df_slice = df[['Survived', 'Pclass', 'PassengerId']]     
slice_pivot = df_slice.pivot_table(index=['Survived'], columns=['Pclass'], \
                                       aggfunc=np.size,fill_value=0)

In [ ]:
slice_pivot

         PassengerId
Pclass             1   2    3
Survived
0                 80  97  372
1                136  87  119

In [ ]:
df_slice = df[['Survived', 'Sex', 'Pclass', 'PassengerId']]     
slice_pivot = df_slice.pivot_table(index=['Survived','Sex'], columns=['Pclass'], \
                                       aggfunc=np.size,fill_value=0)

In [ ]:
slice_pivot

                PassengerId
Pclass                    1   2    3
Survived Sex
0        female           3   6   72
         male            77  91  300
1        female          91  70   72
         male            45  17   47

In [ ]:
#groupby

df_slice.groupby('Sex').mean()

        Survived    Pclass  PassengerId
Sex
female  0.742038  2.159236   431.028662
male    0.188908  2.389948   454.147314

In [ ]:
#crosstab secara default menghitung frekuensi nya

pd.crosstab(df.Survived, df.Sex)

Sex       female  male
Survived
0             81   468
1            233   109

In [ ]:
#binning

df['Alone']=df['SibSp']+df['Parch']

In [ ]:
df['Alone'][df['Alone']>0]='With Family'
df['Alone'][df['Alone']==0]='Without Family'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,With Family
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,With Family
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Without Family
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,With Family
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Without Family

In [ ]:
#categorical encoding

df_slice = df[['Survived','Sex']]
df_slice

     Survived     Sex
0           0    male
1           1  female
2           1  female
3           1  female
4           0    male
..        ...     ...
886         0    male
887         1  female
888         0  female
889         1    male
890         0    male

[891 rows x 2 columns]

In [ ]:
pd.get_dummies(df_slice,'Sex')

     Survived  Sex_female  Sex_male
0           0           0         1
1           1           1         0
2           1           1         0
3           1           1         0
4           0           0         1
..        ...         ...       ...
886         0           0         1
887         1           1         0
888         0           1         0
889         1           0         1
890         0           0         1

[891 rows x 3 columns]